TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
/*
 * ESP32-S3 N16R8 PTZ Camera Mount - PRODUCTION FIRMWARE (Receiver)
 * ================================================================
 * Translates incoming ESP-NOW commands from ESP32S3_Remote_TX into:
 *   1. Dual BIGTREETECH TMC2209 V1.3 stepper motion via HardwareSerial UART & FastAccelStepper
 *   2. Sony FDR-AX53 Zoom Control via 40 kHz 15-bit SIRC IR Transmitter on GPIO 8
 *   3. Dead-Reckoning Zoom Tracking & Automatic Wide Homing
 *   4. Center-Aware Stepper Homing with NVS direction memory & +/-180 deg cable-wrap safety
 *   5. Non-Volatile (NVS) Presets (Pan, Tilt, Zoom) recallable by Remote and future Laptop Wi-Fi
 *
 * Master Wiring & Hardware Architecture:
 * -------------------------------------------------------------------------
 *   - Pan Stepper (TMC2209 #1 - Serial1):
 *       EN: GPIO 4 | STEP: GPIO 5 | DIR: GPIO 6
 *       TX: GPIO 10 -> 1k Ohm resistor -> joins RX line
 *       RX: GPIO 11 -> connects to 1k resistor & goes to Pan Driver RX (PDN_UART)
 *
 *   - Tilt Stepper (TMC2209 #2 - Serial2):
 *       EN: GPIO 7 | STEP: GPIO 15 | DIR: GPIO 16
 *       TX: GPIO 38 -> 1k Ohm resistor -> joins RX line
 *       RX: GPIO 39 -> connects to 1k resistor & goes to Tilt Driver RX (PDN_UART)
 *
 *   - 3W IR Transmitter Module (Sony FDR-AX53 Zoom):
 *       Signal: ESP32-S3 GPIO 8 -> Logic Level Shifter LV1 -> HV1 (5V) -> IR IN pin
 *       Power:  5V Rail -> IR Module VCC | GND Rail -> IR Module GND
 *       Carrier: 40 kHz (33% duty cycle) hardware LEDC PWM
 *       Codes:  Sony 15-bit SIRC (Address 0xD9, Tele 0x1A, Wide 0x1B)
 *
 *   - Hall-Effect Sensors (A3144 - Active LOW):
 *       Pan Hall:  Pin 1 to 3V3, Pin 2 to GND, Pin 3 to GPIO 17
 *       Tilt Hall: Pin 1 to 3V3, Pin 2 to GND, Pin 3 to GPIO 18
 *
 *   - Relay Module (Aux):
 *       IN: GPIO 9 | VCC: 5V Rail | GND: 5V Rail
 *
 * Required Libraries (Install via Arduino Library Manager):
 *   1. FastAccelStepper (v0.30.0+) by Gin66
 *   2. TMCStepper       (v0.7.3+)  by teemuatlut
 *
 * Board Settings (Arduino IDE):
 *   - Board: ESP32S3 Dev Module
 *   - Flash Size: 16MB (128Mb)
 *   - PSRAM: "OPI PSRAM"
 *   - USB CDC On Boot: "Enabled"
 *   - Upload Speed: 921600
 */

#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <FastAccelStepper.h>
#include <TMCStepper.h>
#include <Preferences.h>
#include <freertos/queue.h>

// Forward declaration
struct MotorState;

// ---------------------------------------------------------------------------
// Wi-Fi credentials (2.4 GHz network the mount joins)
// ---------------------------------------------------------------------------
const char* WIFI_SSID = "Netgear";
const char* WIFI_PASS = "windows12";

// ---------------------------------------------------------------------------
// Pin definitions & Master Wiring Map
// ---------------------------------------------------------------------------
// Pan stepper (TMC2209 #1 - Serial1)
#define PIN_PAN_EN        4    // Active LOW enable
#define PIN_PAN_STEP      5    // Step pulse
#define PIN_PAN_DIR       6    // Direction
#define PIN_PAN_TX       10    // ESP32-S3 TX -> 1k resistor -> joins RX
#define PIN_PAN_RX       11    // ESP32-S3 RX -> connects to 1k resistor & TMC2209 RX (PDN_UART)

// Tilt stepper (TMC2209 #2 - Serial2)
#define PIN_TILT_EN       7    // Active LOW enable
#define PIN_TILT_STEP    15    // Step pulse
#define PIN_TILT_DIR     16    // Direction
#define PIN_TILT_TX      38    // ESP32-S3 TX -> 1k resistor -> joins RX
#define PIN_TILT_RX      39    // ESP32-S3 RX -> connects to 1k resistor & TMC2209 RX (PDN_UART)

// Hall-Effect Sensors (A3144 Active LOW with internal PULLUP)
#define PIN_PAN_HALL     17    // Pan zero-reference Hall sensor
#define PIN_TILT_HALL    18    // Tilt zero-reference Hall sensor

// Sony Camcorder IR Transmitter & Relay Aux
#define PIN_IR_IN         8    // 3W IR transmitter via 5V level shifter
#define PIN_RELAY_IN      9    // Relay trigger module

// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// TMC2209 Driver Configuration Parameters
// ---------------------------------------------------------------------------
#define R_SENSE           0.11f // Sense resistor on BIGTREETECH TMC2209 V1.3 (0.11 Ohm)
#define DRIVER_ADDRESS    0b00  // TMC2209 UART address (MS1=GND, MS2=GND -> 0b00)
#define RMS_CURRENT_MA    900   // RMS current in mA for Usongshine 17HS4023 (0.90A reduced from 0.95A to keep motors cool)
#define MICROSTEPS_VAL    16    // 1/16 microstepping via UART register

// ---------------------------------------------------------------------------
// Herringbone Gear Ratios & Microstepping Calculations:
//   Motor: 200 full steps/rev (1.8 deg) * 16 microsteps = 3200 steps/motor rev
//   Pan Axis : 17T Motor -> 144T Driven (Ratio = 144/17 ~ 8.470588)
//              Output rev = 3200 * 144 / 17 = 460800 / 17 ~ 27105.88 steps / 360 deg
//              Steps/deg  = 1280 / 17 ~ 75.294118 steps/deg
//              Travel     = +/-40 deg = +/-3012 steps
//   Tilt Axis: 21T Motor -> 64T Driven (Ratio = 64/21 ~ 3.047619)
//              Output rev = 3200 * 64 / 21 = 204800 / 21 ~ 9752.38 steps / 360 deg
//              Steps/deg  = 5120 / 189 ~ 27.089947 steps/deg
//              Travel     = +/-45 deg = +/-1219 steps
// ---------------------------------------------------------------------------
#define PAN_STEPS_PER_DEG   75.2941f
#define TILT_STEPS_PER_DEG  27.0899f

#define MAX_PAN_STEPS       3012    // +/-40 deg max travel from center (0)
#define MAX_TILT_STEPS      1219    // +/-45 deg max travel from center (0)

#define TILT_LEVEL_OFFSET_STEPS  (+160) // ~ +6.0 deg upward adjustment to perfectly level horizon

#define MAX_SPEED_HZ        4500   // Full-stick max speed (steps/s) ~60 deg/s on Pan
#define MIN_SPEED_HZ         150   // Slowest creep speed at deadzone threshold
#define ACCEL_HZ_S         25000   // Operational acceleration ramp (steps/s^2)
#define JOY_DEAD              60   // Command deadzone (out of +/-1000)
#define RX_TIMEOUT_MS        2500  // Failsafe link-loss timeout (ms) - generous margin for dual-stick motion
#define PWR_SETTLE_DELAY_MS 2000   // Wait for 12V rail & driver logic to stabilize

// ---------------------------------------------------------------------------
// Cinematic Preset Smooth Transition Speeds
// ---------------------------------------------------------------------------
#define PRESET_MAX_SPEED_HZ 1600   // Smooth, elegant cinematic pan/tilt speed (~20 deg/s)
#define PRESET_MIN_SPEED_HZ  150   // Smooth arrival speed floor
#define PRESET_ACCEL_HZ_S   2500   // Gentle cinematic ease-in / ease-out acceleration ramp

// ---------------------------------------------------------------------------
// Homing Parameters (High-Precision Calibration)
// ---------------------------------------------------------------------------
#define HOMING_SEARCH_SPEED_HZ  1200 // Controlled speed for reliable sensor detection (steps/s)
#define HOMING_CREEP_SPEED_HZ    250 // Precision latch speed (steps/s)
#define HOMING_BACKOFF_STEPS     250 // Short negative-side backoff to clear magnetic hysteresis
#define HOMING_ACCEL_HZ_S       6000 // Controlled smooth acceleration during homing

// ---------------------------------------------------------------------------
// Sony FDR-AX53 IR Zoom Configuration (40 kHz, 15-bit SIRC)
// ---------------------------------------------------------------------------
#define SONY_IR_CARRIER_HZ      40000 // Sony standard carrier frequency (40 kHz, 33% duty)
#define SONY_IR_ADDR_CAM        0xD9  // Sony Camcorder Address (0xD9)
#define SONY_IR_CMD_ZOOM_TELE   0x1A  // Zoom Telephoto / In  (0x1A)
#define SONY_IR_CMD_ZOOM_WIDE   0x1B  // Zoom Wide / Out      (0x1B)

// ---------------------------------------------------------------------------
// Dead-Reckoning Zoom Timing Model (Sony FDR-AX53 Optical Travel)
// ---------------------------------------------------------------------------
// CALIBRATION: Standard Sony FDR-AX53 optical travel time from 0% (Wide) to 100% (Tele)
// is ~3500 ms (3.5s) at the 45ms Sony repeat rate.
// To fine-tune for your specific setup: adjust ZOOM_FULL_RANGE_MS to your measured travel time!
#define ZOOM_FULL_RANGE_MS     13000  // Full optical zoom travel in ms (0 = Wide, 13000 = Tele ~ 13.0s)
#define ZOOM_FRAME_MS             45  // Sony SIRC repeat period (25.5ms packet + 19.5ms gap)
#define ZOOM_TICK_MS   ZOOM_FRAME_MS  // Cadence tick step for dead-reckoning (45 ms)
#define ZOOM_HOMING_TIME_MS    14500  // Continuous Wide drive duration during startup homing (14.5s)
#define ZOOM_ACTIVE_WINDOW_MS    150  // Active window for fast telemetry updates during zoom
#define ZOOM_FAST_TELEMETRY_MS   100  // Interval for fast telemetry while zooming

// Zoom-Adaptive Dynamic Speed Scaling (Focal Length Adaptive)
#define ZOOM_SPEED_SCALE_MIN    0.20f // At 100% Tele, Pan/Tilt max speed scales down to 20% of normal
#define ZOOM_ACCEL_SCALE_MIN    0.35f // At 100% Tele, Pan/Tilt acceleration scales down to 35% of normal

// LEDC PWM Channel for IR Carrier
const uint8_t IR_LEDC_CH = 0;
const uint8_t IR_DUTY_33 = 85; // 33% duty cycle of 255

// ---------------------------------------------------------------------------
// ESP-NOW Packet Protocol (KEEP IN SYNC with ESP32S3_Remote_TX)
// ---------------------------------------------------------------------------
#define PKT_PAIR_REQ      0x01
#define PKT_PAIR_ACK      0x02
#define PKT_CONTROL       0x03
#define PKT_SAVE_PRESET   0x04
#define PKT_GOTO_PRESET   0x05
#define PKT_START_HOMING  0x06
#define PKT_TELEMETRY     0x07

enum ButtonBits : uint16_t {
  BTNBIT_LJOY      = 1 << 0,
  BTNBIT_RJOY      = 1 << 1,
  BTNBIT_PSH       = 1 << 2,
  BTNBIT_CON       = 1 << 3,
  BTNBIT_BAK       = 1 << 4,
  BTNBIT_C1        = 1 << 5,
  BTNBIT_C2        = 1 << 6,
  BTNBIT_C3        = 1 << 7,
  BTNBIT_C4        = 1 << 8,
  BTNBIT_C5        = 1 << 9,
  BTNBIT_ZOOM_SLOW = 1 << 10,
};

struct __attribute__((packed)) PtzPacket {
  uint8_t  type;                  // PKT_*
  uint8_t  mac[6];                // sender MAC (pairing handshake)
  int16_t  pan;                   // -1000..+1000 velocity command
  int16_t  tilt;                  // -1000..+1000 velocity command
  int16_t  zoom;                  // -1000..+1000 zoom command (Right Stick Y: + Tele, - Wide)
  int16_t  auxX;                  // right stick X (reserved)
  uint16_t buttons;               // BTNBIT_* bitfield
  uint8_t  presetId;              // Preset slot (1..8) for SAVE/GOTO
  uint8_t  seq;                   // rolling sequence number
};

struct __attribute__((packed)) MountTelemetryPacket {
  uint8_t  type;                  // PKT_TELEMETRY (0x07)
  uint8_t  mac[6];                // Mount MAC
  uint8_t  panUartOk;             // 1 if Pan TMC2209 version == 0x21, else 0
  uint8_t  panVersion;            // IC version register value (e.g. 0x21)
  uint8_t  tiltUartOk;            // 1 if Tilt TMC2209 version == 0x21, else 0
  uint8_t  tiltVersion;           // IC version register value (e.g. 0x21)
  uint8_t  panHallDetected;       // 1 if magnet detected (LOW on pin), 0 if clear
  uint8_t  tiltHallDetected;      // 1 if magnet detected (LOW on pin), 0 if clear
  int8_t   panSide;               // -1 = Left (CCW), 0 = Center, +1 = Right (CW)
  int8_t   tiltSide;              // -1 = Down, 0 = Center, +1 = Up
  int32_t  panSteps;              // Current pan position in steps
  int32_t  tiltSteps;             // Current tilt position in steps
  float    panDeg;                // Calculated pan angle in degrees (-40.0 .. +40.0)
  float    tiltDeg;               // Calculated tilt angle in degrees (-45.0 .. +45.0)
  uint16_t zoomMs;                // Current zoom dead-reckoning position (0..3500 ms)
  uint8_t  zoomPct;               // Zoom percentage (0..100%)
  uint8_t  isHomed;               // 1 if homing complete
  uint8_t  state;                 // 0=IDLE, 1=LIVE_MOVING, 2=HOMING, 3=GOTO_PRESET
  uint8_t  activePreset;          // Target preset ID if moving
  char     eventMsg[32];          // Null-terminated event string (e.g. "Pan Hall Tripped")
};

// ---------------------------------------------------------------------------
// Preset Structure & Storage
// ---------------------------------------------------------------------------
#define MAX_PRESETS 8

struct Preset {
  bool     valid;
  int32_t  pan;    // Step position
  int32_t  tilt;   // Step position
  uint32_t zoom;   // Milliseconds from Wide (0..3500)
};

Preset presets[MAX_PRESETS] = {};
Preferences prefs;

// ---------------------------------------------------------------------------
// Global Objects & State
// ---------------------------------------------------------------------------
// TMC2209 UART Drivers (HardwareSerial via TMCStepper)
TMC2209Stepper driverPan(&Serial1, R_SENSE, DRIVER_ADDRESS);
TMC2209Stepper driverTilt(&Serial2, R_SENSE, DRIVER_ADDRESS);

