TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
// FastAccelStepper Motion Engine
FastAccelStepperEngine engine;
FastAccelStepper* panStepper  = nullptr;
FastAccelStepper* tiltStepper = nullptr;

struct MotorState {
  int8_t   dir;                 // -1 / 0 / +1 currently commanded direction
  uint32_t spd;                 // currently commanded speed (steps/s)
};
MotorState panState  = {0, 0};
MotorState tiltState = {0, 0};

// Virtual Zoom State (Dead Reckoning)
int32_t  currentZoomMs       = 0;  // 0 = Full Wide, ZOOM_FULL_RANGE_MS = Full Tele
int32_t  targetZoomMs        = 0;
bool     isZoomHomed         = false;
bool     isPanHomed          = false;
bool     isTiltHomed         = false;
bool     isHomingInProgress  = false;
bool     isMovingToPreset    = false;
uint8_t  currentTargetPreset = 0;

// Center Direction Memory: -1 = Left/Down of center, +1 = Right/Up of center, 0 = Center
int8_t   lastPanSide  = 0;
int8_t   lastTiltSide = 0;

// Hardware & Driver Health Status
bool     panUartOk          = false;
bool     tiltUartOk         = false;
uint8_t  panDriverVersion   = 0;
uint8_t  tiltDriverVersion  = 0;
bool     wifiConnected      = false;

// ESP-NOW and Remote Link State
uint8_t          remoteMac[6] = {0};
bool             hasRemote    = false;
PtzPacket        lastPkt      = {};
volatile bool    rxFresh      = false;
uint32_t         lastRxMs     = 0;
bool             linkAlive    = false;

// ---------------------------------------------------------------------------
// Hardware LEDC 40 kHz IR Carrier Generator
// ---------------------------------------------------------------------------
void initIrLedc() {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcAttachChannel(PIN_IR_IN, SONY_IR_CARRIER_HZ, 8, IR_LEDC_CH);
  ledcWrite(PIN_IR_IN, 0);
#else
  ledcSetup(IR_LEDC_CH, SONY_IR_CARRIER_HZ, 8);
  ledcAttachPin(PIN_IR_IN, IR_LEDC_CH);
  ledcWrite(IR_LEDC_CH, 0);
#endif
}

inline void irCarrierOn() {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcWrite(PIN_IR_IN, IR_DUTY_33);
#else
  ledcWrite(IR_LEDC_CH, IR_DUTY_33);
#endif
}

inline void irCarrierOff() {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcWrite(PIN_IR_IN, 0);
#else
  ledcWrite(IR_LEDC_CH, 0);
#endif
}

// Transmit single 15-bit Sony SIRC packet (40 kHz modulated)
// Timings matched from genuine Sony FDR-AX53 remote captures:
// Header: 2450us ON, 550us OFF
// Bit 1 : 1250us ON, 550us OFF
// Bit 0 :  650us ON, 550us OFF
void sendSony15Packet(uint8_t address, uint8_t command) {
  noInterrupts(); // Ensure zero pulse jitter during 25ms packet

  // Header: 2450us mark, 550us space
  irCarrierOn();
  delayMicroseconds(2450);
  irCarrierOff();
  delayMicroseconds(550);

  // 7-bit Command (LSB first)
  for (uint8_t i = 0; i < 7; i++) {
    irCarrierOn();
    if ((command >> i) & 1) {
      delayMicroseconds(1250);
    } else {
      delayMicroseconds(650);
    }
    irCarrierOff();
    delayMicroseconds(550);
  }

  // 8-bit Address (LSB first)
  for (uint8_t i = 0; i < 8; i++) {
    irCarrierOn();
    if ((address >> i) & 1) {
      delayMicroseconds(1250);
    } else {
      delayMicroseconds(650);
    }
    irCarrierOff();
    delayMicroseconds(550);
  }

  interrupts();
}

// ---------------------------------------------------------------------------
// Non-Blocking Sony SIRC IR Transmitter (Dedicated Task + Precision Cadence)
// ---------------------------------------------------------------------------
// Pinned to Core 0 at priority 1 to keep Core 1 100% dedicated to FastAccelStepper.
// Uses canonical FreeRTOS vTaskDelayUntil for strictly deterministic 45.0 ms start-to-start timing.
volatile uint8_t  g_irActiveCmd     = 0;
volatile uint32_t g_irActiveUntilMs = 0;
volatile uint32_t irLastCmdMs       = 0;

void irTransmitTask(void* pvParameters) {
  TickType_t xLastWakeTime = xTaskGetTickCount();
  const TickType_t xFrequency = pdMS_TO_TICKS(45); // Exact 45 ms period

  while (true) {
    vTaskDelayUntil(&xLastWakeTime, xFrequency);

    uint32_t nowMs = millis();
    if (g_irActiveCmd != 0 && nowMs < g_irActiveUntilMs) {
      sendSony15Packet(SONY_IR_ADDR_CAM, g_irActiveCmd);
      irLastCmdMs = millis();
    }
  }
}

// Backward-compatible non-blocking queue/command trigger
bool queueIrCommand(uint8_t cmd) {
  g_irActiveCmd = cmd;
  g_irActiveUntilMs = millis() + 180;
  return true;
}

// ---------------------------------------------------------------------------
// Dead-Reckoning Zoom Engine (Direct Wall-Clock Integration & Soft Limits)
// ---------------------------------------------------------------------------
void homeZoom() {
  Serial.printf("\n[Zoom Homing] Starting: Driving Wide to physical lens stop (%u ms)...\n", ZOOM_HOMING_TIME_MS);
  g_irActiveCmd = SONY_IR_CMD_ZOOM_WIDE;
  g_irActiveUntilMs = millis() + ZOOM_HOMING_TIME_MS;
  delay(ZOOM_HOMING_TIME_MS);
  g_irActiveCmd = 0;
  g_irActiveUntilMs = 0;
  currentZoomMs = 0;
  isZoomHomed = true;
  Serial.println("[Zoom Homing] Completed! Calibrated at 0.0% Wide (0 ms).\n");
}

// Handle real-time manual zoom commands from joystick (Sony 45 ms framing via IR TX task)
void applyZoom(int16_t cmd) {
  static uint32_t lastZoomActiveMs = 0;
  uint32_t now = millis();

  if (abs(cmd) < JOY_DEAD) {
    lastZoomActiveMs = 0;
    return; // Center deadzone -> idle (let in-flight 180ms window cleanly expire)
  }

  bool zoomIn = (cmd > 0);

  // Soft Limit Guard: Prevent driving past mechanical stops (0..ZOOM_FULL_RANGE_MS)
  if (zoomIn && currentZoomMs >= ZOOM_FULL_RANGE_MS) {
    lastZoomActiveMs = 0;
    g_irActiveCmd = 0;
    g_irActiveUntilMs = 0;
    return;
  }
  if (!zoomIn && currentZoomMs <= 0) {
    lastZoomActiveMs = 0;
    g_irActiveCmd = 0;
    g_irActiveUntilMs = 0;
    return;
  }

  // Calculate elapsed time while actively driving zoom
  uint32_t elapsedMs = 0;
  if (lastZoomActiveMs != 0) {
    elapsedMs = now - lastZoomActiveMs;
    if (elapsedMs > 100) elapsedMs = 100; // Guard against packet delay spikes
  }
  lastZoomActiveMs = now;

