TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
  // Signal continuous IR transmission: keep alive for 180 ms (auto-refreshed by 50 Hz control stream)
  uint8_t code = zoomIn ? SONY_IR_CMD_ZOOM_TELE : SONY_IR_CMD_ZOOM_WIDE;
  g_irActiveCmd = code;
  g_irActiveUntilMs = now + 180;

  // Dead-reckoning tracks exact elapsed wall-clock travel time (0..ZOOM_FULL_RANGE_MS)
  if (zoomIn) {
    currentZoomMs += elapsedMs;
    if (currentZoomMs > ZOOM_FULL_RANGE_MS) currentZoomMs = ZOOM_FULL_RANGE_MS;
  } else {
    currentZoomMs -= elapsedMs;
    if (currentZoomMs < 0) currentZoomMs = 0;
  }
}

// Coordinated Preset Zoom Smooth Transition (enqueues IR frames non-blocking)
void updatePresetZoomMove() {
  if (!isMovingToPreset) return;

  uint32_t now = millis();
  static uint32_t lastPresetStepMs = 0;

  uint32_t elapsedMs = 0;
  if (lastPresetStepMs != 0) {
    elapsedMs = now - lastPresetStepMs;
    if (elapsedMs > 100) elapsedMs = 100;
  }
  lastPresetStepMs = now;

  int32_t diff = (int32_t)targetZoomMs - (int32_t)currentZoomMs;

  if (abs(diff) <= 25) {
    currentZoomMs = targetZoomMs;
    lastPresetStepMs = 0;
    g_irActiveCmd = 0;
    g_irActiveUntilMs = 0;
    return;
  }

  bool zoomIn = (diff > 0);
  uint8_t code = zoomIn ? SONY_IR_CMD_ZOOM_TELE : SONY_IR_CMD_ZOOM_WIDE;
  g_irActiveCmd = code;
  g_irActiveUntilMs = now + 100;

  if (zoomIn) {
    currentZoomMs += elapsedMs;
    if (currentZoomMs > (int32_t)targetZoomMs) currentZoomMs = targetZoomMs;
  } else {
    currentZoomMs -= elapsedMs;
    if (currentZoomMs < (int32_t)targetZoomMs) currentZoomMs = targetZoomMs;
  }
}

// ---------------------------------------------------------------------------
// NVS Preset Management
// ---------------------------------------------------------------------------
void loadPresetsFromNVS() {
  prefs.begin("ptz_presets", true); // read-only
  for (uint8_t i = 0; i < MAX_PRESETS; i++) {
    char key[16];
    snprintf(key, sizeof(key), "p%u_v", i);
    presets[i].valid = prefs.getBool(key, false);
    if (presets[i].valid) {
      snprintf(key, sizeof(key), "p%u_pan", i);
      presets[i].pan = prefs.getInt(key, 0);
      snprintf(key, sizeof(key), "p%u_tilt", i);
      presets[i].tilt = prefs.getInt(key, 0);
      snprintf(key, sizeof(key), "p%u_zm", i);
      presets[i].zoom = prefs.getUInt(key, 0);
      Serial.printf("[NVS] Loaded Preset %u: Pan=%ld, Tilt=%ld, Zoom=%lu ms\n",
                    i + 1, presets[i].pan, presets[i].tilt, presets[i].zoom);
    }
  }
  prefs.end();
}

// ---------------------------------------------------------------------------
// Telemetry Transmission to Remote Controller
// ---------------------------------------------------------------------------
void sendMountTelemetry(const char* eventDesc = nullptr) {
  if (!hasRemote) return;

  MountTelemetryPacket telem = {};
  telem.type = PKT_TELEMETRY;
  WiFi.macAddress(telem.mac);

  telem.panUartOk = panUartOk ? 1 : 0;
  telem.panVersion = panDriverVersion;
  telem.tiltUartOk = tiltUartOk ? 1 : 0;
  telem.tiltVersion = tiltDriverVersion;

  telem.panHallDetected = (digitalRead(PIN_PAN_HALL) == LOW) ? 1 : 0;
  telem.tiltHallDetected = (digitalRead(PIN_TILT_HALL) == LOW) ? 1 : 0;

  int32_t curPan = panStepper ? panStepper->getCurrentPosition() : 0;
  int32_t curTilt = tiltStepper ? tiltStepper->getCurrentPosition() : 0;
  telem.panSteps = curPan;
  telem.tiltSteps = curTilt;

  telem.panDeg = (float)curPan / PAN_STEPS_PER_DEG;
  telem.tiltDeg = (float)curTilt / TILT_STEPS_PER_DEG;

  if (telem.panHallDetected || abs(curPan) < 50) {
    telem.panSide = 0; // At Center Hall
  } else if (curPan > 0) {
    telem.panSide = 1; // RIGHT / CW of Center Hall
  } else {
    telem.panSide = -1; // LEFT / CCW of Center Hall
  }

  if (telem.tiltHallDetected || abs(curTilt) < 25) {
    telem.tiltSide = 0; // At Center Hall
  } else if (curTilt > 0) {
    telem.tiltSide = 1; // UP of Center Hall
  } else {
    telem.tiltSide = -1; // DOWN of Center Hall
  }

  telem.zoomMs = (uint16_t)currentZoomMs;
  telem.zoomPct = (uint8_t)((currentZoomMs * 100) / ZOOM_FULL_RANGE_MS);
  telem.isHomed = (isPanHomed && isTiltHomed && isZoomHomed) ? 1 : 0;

  if (isHomingInProgress) telem.state = 2; // HOMING
  else if (isMovingToPreset) telem.state = 3; // GOTO_PRESET
  else if (panStepper && (panStepper->isRunning() || (tiltStepper && tiltStepper->isRunning()))) telem.state = 1; // LIVE_MOVING
  else telem.state = 0; // IDLE

  telem.activePreset = currentTargetPreset;

  if (eventDesc != nullptr) {
    strncpy(telem.eventMsg, eventDesc, sizeof(telem.eventMsg) - 1);
    telem.eventMsg[sizeof(telem.eventMsg) - 1] = '\0';
  } else {
    telem.eventMsg[0] = '\0';
  }

  esp_now_send(remoteMac, (uint8_t*)&telem, sizeof(telem));
}

void savePreset(uint8_t id) {
  if (id < 1 || id > MAX_PRESETS) return;
  uint8_t idx = id - 1;

  presets[idx].valid = true;
  presets[idx].pan   = panStepper  ? panStepper->getCurrentPosition()  : 0;
  presets[idx].tilt  = tiltStepper ? tiltStepper->getCurrentPosition() : 0;
  presets[idx].zoom  = currentZoomMs;

  prefs.begin("ptz_presets", false); // read-write
  char key[16];
  snprintf(key, sizeof(key), "p%u_v", idx);
  prefs.putBool(key, true);
  snprintf(key, sizeof(key), "p%u_pan", idx);
  prefs.putInt(key, presets[idx].pan);
  snprintf(key, sizeof(key), "p%u_tilt", idx);
  prefs.putInt(key, presets[idx].tilt);
  snprintf(key, sizeof(key), "p%u_zm", idx);
  prefs.putUInt(key, presets[idx].zoom);
  prefs.end();

  Serial.printf("\n>>> [PRESET SAVED] Preset %u: Pan=%ld, Tilt=%ld, Zoom=%lu ms (%0.1f%%) <<<\n\n",
                id, presets[idx].pan, presets[idx].tilt, presets[idx].zoom,
                (float)presets[idx].zoom / ZOOM_FULL_RANGE_MS * 100.0f);

  char evt[32];
  snprintf(evt, sizeof(evt), "Preset %u Saved to NVS", id);
  sendMountTelemetry(evt);
}

void gotoPreset(uint8_t id) {
  if (id < 1 || id > MAX_PRESETS) return;
  uint8_t idx = id - 1;

  if (!presets[idx].valid) {
    Serial.printf("[PRESET ERROR] Preset %u is unprogrammed!\n", id);
    char evt[32];
    snprintf(evt, sizeof(evt), "Preset %u Unprogrammed!", id);
    sendMountTelemetry(evt);
    return;
  }

  currentTargetPreset = id;
  int32_t targetPan = constrain(presets[idx].pan, -MAX_PAN_STEPS, MAX_PAN_STEPS);
  int32_t targetTilt = constrain(presets[idx].tilt, -MAX_TILT_STEPS, MAX_TILT_STEPS);

  int32_t curPan = panStepper ? panStepper->getCurrentPosition() : 0;
  int32_t curTilt = tiltStepper ? tiltStepper->getCurrentPosition() : 0;

