TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
  int32_t deltaPan = abs(targetPan - curPan);
  int32_t deltaTilt = abs(targetTilt - curTilt);
  int32_t maxDelta = max(deltaPan, deltaTilt);

  Serial.printf("\n>>> [COORDINATED GOTO P%u] Pan: %ld->%ld (d=%ld) | Tilt: %ld->%ld (d=%ld) | Zoom: %lu ms <<<\n",
                id, curPan, targetPan, deltaPan, curTilt, targetTilt, deltaTilt, presets[idx].zoom);

  if (maxDelta > 0) {
    // Proportional speed and acceleration scaling: Both steppers start, cruise, and arrive simultaneously with smooth cinematic ramps!
    uint32_t panSpeed = map(deltaPan, 0, maxDelta, PRESET_MIN_SPEED_HZ, PRESET_MAX_SPEED_HZ);
    uint32_t tiltSpeed = map(deltaTilt, 0, maxDelta, PRESET_MIN_SPEED_HZ, PRESET_MAX_SPEED_HZ);

    uint32_t panAccel = map(deltaPan, 0, maxDelta, 1000, PRESET_ACCEL_HZ_S);
    uint32_t tiltAccel = map(deltaTilt, 0, maxDelta, 1000, PRESET_ACCEL_HZ_S);

    if (panStepper) {
      panStepper->setSpeedInHz(max((uint32_t)150, panSpeed));
      panStepper->setAcceleration(max((uint32_t)1000, panAccel));
      panStepper->applySpeedAcceleration();
      panStepper->moveTo(targetPan);
    }

    if (tiltStepper) {
      tiltStepper->setSpeedInHz(max((uint32_t)150, tiltSpeed));
      tiltStepper->setAcceleration(max((uint32_t)1000, tiltAccel));
      tiltStepper->applySpeedAcceleration();
      tiltStepper->moveTo(targetTilt);
    }
  }

  // Zoom move (clamp to calibrated optical range, so stale presets can never over-drive)
  targetZoomMs = min((uint32_t)presets[idx].zoom, (uint32_t)ZOOM_FULL_RANGE_MS);
  isMovingToPreset = true;

  char evt[32];
  snprintf(evt, sizeof(evt), "Moving to Preset %u...", id);
  sendMountTelemetry(evt);
}

// ---------------------------------------------------------------------------
// Center-Memory NVS Tracker
// ---------------------------------------------------------------------------
void loadPanSideNVS() {
  prefs.begin("ptz_state", true);
  lastPanSide = prefs.getChar("pan_side", 0);
  prefs.end();
  Serial.printf("[NVS] Loaded last known Pan side from center: %d (%s)\n",
                lastPanSide, (lastPanSide > 0) ? "RIGHT" : ((lastPanSide < 0) ? "LEFT" : "CENTER"));
}

void savePanSideNVS(int8_t side) {
  if (side == lastPanSide) return;
  lastPanSide = side;
  prefs.begin("ptz_state", false);
  prefs.putChar("pan_side", side);
  prefs.end();
}

void loadTiltSideNVS() {
  prefs.begin("ptz_state", true);
  lastTiltSide = prefs.getChar("tilt_side", 0);
  prefs.end();
  Serial.printf("[NVS] Loaded last known Tilt side from center: %d (%s)\n",
                lastTiltSide, (lastTiltSide > 0) ? "UP" : ((lastTiltSide < 0) ? "DOWN" : "CENTER"));
}

void saveTiltSideNVS(int8_t side) {
  if (side == lastTiltSide) return;
  lastTiltSide = side;
  prefs.begin("ptz_state", false);
  prefs.putChar("tilt_side", side);
  prefs.end();
}

// ---------------------------------------------------------------------------
// TMC2209 Initialization via UART with Diagnostic Logging
// ---------------------------------------------------------------------------
bool setupTMC2209(TMC2209Stepper& driver, const char* name, uint8_t txPin, uint8_t rxPin, uint16_t current_mA) {
  driver.begin();
  delay(50);

  uint8_t version = driver.version();
  if (version == 0x00 || version == 0xFF) {
    delay(100);
    version = driver.version();
  }

  bool isOk = (version == 0x21);
  if (strcmp(name, "Pan") == 0) {
    panDriverVersion = version;
    panUartOk = isOk;
  } else {
    tiltDriverVersion = version;
    tiltUartOk = isOk;
  }

  Serial.printf("\n[TMC2209 DIAG] === %s Stepper Driver (TX: GPIO %d, RX: GPIO %d) ===\n", name, txPin, rxPin);
  Serial.printf("  IC Version Register      : 0x%02X\n", version);
  Serial.flush();

  if (version == 0x21) {
    Serial.printf("  [PASS] %s driver version 0x21 verified (TMC2209 authentic silicon OK)!\n", name);
  } else {
    Serial.printf("  [WARNING] %s driver returned version 0x%02X (Expected 0x21).\n", name, version);
  }

  uint8_t ifcnt_before = driver.IFCNT();

  driver.toff(5);                        // Enable driver power stage (TOFF = 5)
  driver.rms_current(current_mA, 0.90f); // 900 mA RMS with 90% standstill hold ratio
  driver.ihold(28);                      // 28/31 (~90%) holding current to prevent motor heating
  driver.irun(31);                       // 31/31 full running current
  driver.iholddelay(2);                  // Settle smoothly to standstill current
  driver.pwm_ofs(160);                   // Optimized standstill voltage offset for cool & quiet holding
  driver.pwm_autoscale(true);            // Automatic current scaling
  driver.pwm_autograd(true);             // Automatic gradient adaptation
  driver.en_spreadCycle(false);          // STRICTLY StealthChop2 enabled for silent operation
  driver.mstep_reg_select(true);         // Microstepping configured via UART register
  driver.microsteps(MICROSTEPS_VAL);     // 1/16 microstepping
  driver.blank_time(24);                 // Comparator blank time
  driver.GSTAT(7);                       // Clear reset, drv_err, and uv_cp error flags (write-1-to-clear)

  uint8_t ifcnt_after = driver.IFCNT();
  uint8_t cs = driver.cs_actual();

  Serial.printf("  IFCNT Transmission Writes: %u -> %u (%s)\n", 
                ifcnt_before, ifcnt_after, (ifcnt_after != ifcnt_before) ? "ACCEPTED" : "NO ACK");
  Serial.printf("  Holding / Run Current    : %u mA (CS_ACTUAL: %u/31, 0.90A / 90%% Hold Ratio Active)\n", current_mA, cs);
  Serial.printf("  StealthChop2 Silent Mode : %s (pwm_ofs=180 high-torque standstill active)\n", driver.stealth() ? "ACTIVE" : "SpreadCycle");
  Serial.printf("[TMC2209] %s initialization completed.\n\n", name);

  return (version == 0x21);
}

// ---------------------------------------------------------------------------
// FastAccelStepper Setup
// ---------------------------------------------------------------------------
FastAccelStepper* setupStepper(uint8_t stepPin, uint8_t dirPin, uint8_t enPin) {
  FastAccelStepper* s = engine.stepperConnectToPin(stepPin);
  if (!s) {
    Serial.printf("ERROR: no stepper resource for STEP pin %d\n", stepPin);
    return nullptr;
  }
  s->setDirectionPin(dirPin);
  s->setEnablePin(enPin);        // TMC2209 EN is active LOW
  s->setAcceleration(ACCEL_HZ_S);
  s->enableOutputs();            // Maintain energized state for payload holding torque
  return s;
}

// ---------------------------------------------------------------------------
// Homing Abort Check Helper (Detects Deliberate Joystick Override)
// ---------------------------------------------------------------------------
bool checkHomingAbort() {
  if (abs(lastPkt.pan) > 600 || abs(lastPkt.tilt) > 600) {
    Serial.println("\n[HOMING ABORT] Manual joystick deflection detected! Aborting homing immediately.");
    return true;
  }
  return false;
}

// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// Digital Debounce Helpers for Hall-Effect Sensors (Active LOW)
// ---------------------------------------------------------------------------
bool isHallTripped(uint8_t pin) {
  if (digitalRead(pin) != LOW) return false;
  for (uint8_t i = 0; i < 3; i++) {
    delayMicroseconds(50);
    if (digitalRead(pin) != LOW) return false;
  }
  return true;
}

