TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
bool isHallClear(uint8_t pin) {
  if (digitalRead(pin) != HIGH) return false;
  for (uint8_t i = 0; i < 3; i++) {
    delayMicroseconds(50);
    if (digitalRead(pin) != HIGH) return false;
  }
  return true;
}

// ---------------------------------------------------------------------------
// High-Precision Bounded Bidirectional Simultaneous 2-Axis Homing Engine
// ---------------------------------------------------------------------------
bool homeAxesSimultaneous(int32_t tiltLevelOffset) {
  if (!panStepper || !tiltStepper) return false;

  Serial.println("\n=======================================================");
  Serial.println("[HOMING START] Initializing Bounded Bidirectional Precision Homing");
  Serial.println("=======================================================");

  // Ensure outputs are energized
  panStepper->enableOutputs();
  tiltStepper->enableOutputs();
  panStepper->setAcceleration(HOMING_ACCEL_HZ_S);
  tiltStepper->setAcceleration(HOMING_ACCEL_HZ_S);

  // Set internal reference positions to 0 at homing entry for bounded travel tracking
  panStepper->setCurrentPosition(0);
  tiltStepper->setCurrentPosition(0);

  // Read initial debounced sensor states
  bool panStartsOnSensor  = isHallTripped(PIN_PAN_HALL);
  bool tiltStartsOnSensor = isHallTripped(PIN_TILT_HALL);

  Serial.printf("[Homing Init] Pan Sensor: %s | Tilt Sensor: %s\n",
                panStartsOnSensor ? "TRIGGERED (LOW)" : "CLEAR (HIGH)",
                tiltStartsOnSensor ? "TRIGGERED (LOW)" : "CLEAR (HIGH)");

  // -------------------------------------------------------------------------
  // FAST-PATH: Both Hall Sensors already LOW (Sitting directly on magnets)
  // -------------------------------------------------------------------------
  if (panStartsOnSensor && tiltStartsOnSensor) {
    Serial.println("[Fast-Path] Both axes already on magnet! Executing quick clearance + precision latch (<= 2s)...");
    sendMountTelemetry("Homing: Fast Latch");

    // Short clearance in negative direction (CCW / Down)
    panStepper->setSpeedInHz(450);
    tiltStepper->setSpeedInHz(450);
    panStepper->applySpeedAcceleration();
    tiltStepper->applySpeedAcceleration();
    panStepper->moveTo(-600);
    tiltStepper->moveTo(-600);

    int32_t panClearPos = 0;
    int32_t tiltClearPos = 0;
    bool panCleared = false;
    bool tiltCleared = false;
    bool panMarginDone = false;
    bool tiltMarginDone = false;
    uint32_t fastStartMs = millis();

    while ((!panMarginDone || !tiltMarginDone) && (millis() - fastStartMs < 2000)) {
      if (checkHomingAbort()) {
        panStepper->forceStop();
        tiltStepper->forceStop();
        return false;
      }
      if (!panCleared && isHallClear(PIN_PAN_HALL)) {
        panCleared = true;
        panClearPos = panStepper->getCurrentPosition();
      }
      if (panCleared && !panMarginDone) {
        if (abs(panStepper->getCurrentPosition() - panClearPos) >= HOMING_BACKOFF_STEPS || !panStepper->isRunning()) {
          panStepper->forceStop();
          panMarginDone = true;
        }
      }
      if (!tiltCleared && isHallClear(PIN_TILT_HALL)) {
        tiltCleared = true;
        tiltClearPos = tiltStepper->getCurrentPosition();
      }
      if (tiltCleared && !tiltMarginDone) {
        if (abs(tiltStepper->getCurrentPosition() - tiltClearPos) >= HOMING_BACKOFF_STEPS || !tiltStepper->isRunning()) {
          tiltStepper->forceStop();
          tiltMarginDone = true;
        }
      }
      delayMicroseconds(500);
    }
    panStepper->forceStop();
    tiltStepper->forceStop();
    delay(20);

    // Precision Creep Latch in Positive Direction (CW / Up)
    panStepper->setSpeedInHz(HOMING_CREEP_SPEED_HZ);
    tiltStepper->setSpeedInHz(HOMING_CREEP_SPEED_HZ);
    panStepper->applySpeedAcceleration();
    tiltStepper->applySpeedAcceleration();
    panStepper->moveTo(panStepper->getCurrentPosition() + 1000);
    tiltStepper->moveTo(tiltStepper->getCurrentPosition() + 1000);

    bool panLatched = false;
    bool tiltLatched = false;
    uint32_t latchStartMs = millis();

    while ((!panLatched || !tiltLatched) && (millis() - latchStartMs < 2500)) {
      if (checkHomingAbort()) {
        panStepper->forceStop();
        tiltStepper->forceStop();
        return false;
      }
      if (!panLatched && isHallTripped(PIN_PAN_HALL)) {
        panStepper->forceStop();
        panLatched = true;
      }
      if (!tiltLatched && isHallTripped(PIN_TILT_HALL)) {
        tiltStepper->forceStop();
        tiltLatched = true;
      }
      delayMicroseconds(300);
    }
    panStepper->forceStop();
    tiltStepper->forceStop();

    if (panLatched && tiltLatched) {
      Serial.println("[Fast-Path SUCCESS] Both axes precision latched!");

      // Stage 4: Apply Horizon Leveling Offset to Tilt
      if (tiltLevelOffset != 0) {
        tiltStepper->setCurrentPosition(0);
        tiltStepper->setSpeedInHz(400);
        tiltStepper->applySpeedAcceleration();
        tiltStepper->moveTo(tiltLevelOffset);
        while (tiltStepper->isRunning()) {
          if (checkHomingAbort()) {
            tiltStepper->forceStop();
            return false;
          }
          delay(1);
        }
      }

      panStepper->setCurrentPosition(0);
      tiltStepper->setCurrentPosition(0);
      panStepper->setSpeedInHz(MAX_SPEED_HZ);
      tiltStepper->setSpeedInHz(MAX_SPEED_HZ);
      panStepper->setAcceleration(ACCEL_HZ_S);
      tiltStepper->setAcceleration(ACCEL_HZ_S);
      panStepper->applySpeedAcceleration();
      tiltStepper->applySpeedAcceleration();

      savePanSideNVS(0);
      saveTiltSideNVS(0);
      Serial.println("[HOMING COMPLETE] Fast-path calibrated in <= 2s.\n");
      return true;
    }
    Serial.println("[Fast-Path Note] Falling through to full bounded bidirectional search.");
  }

  // -------------------------------------------------------------------------
  // GENERAL HOMING: Coordinated Multi-Stage Bounded Bidirectional Search
  // -------------------------------------------------------------------------

  enum AxisHomingState {
    AXIS_PRE_CLEAR,      // If started on sensor: back off negative until clear + margin
    AXIS_SEARCH_PRI,     // Sweep in primary direction (from NVS) up to 1x MAX_STEPS
    AXIS_SEARCH_REV,     // Sweep in reverse direction up to 2x MAX_STEPS across origin to opposite limit
    AXIS_BACKOFF_NEG,    // Back off negative until fully clear + margin
    AXIS_CREEP_LATCH,    // Creep positive slowly to latch magnet edge
    AXIS_LATCHED,        // Axis successfully zeroed
    AXIS_FAILED          // Axis failed to find magnet within full bidirectional bounds
  };

  AxisHomingState panState  = panStartsOnSensor  ? AXIS_PRE_CLEAR : AXIS_SEARCH_PRI;
  AxisHomingState tiltState = tiltStartsOnSensor ? AXIS_PRE_CLEAR : AXIS_SEARCH_PRI;

  // Primary search directions determined by NVS memory
  // (+1 = was positive side -> search Negative/CCW; -1 = was negative side -> search Positive/CW; 0 = search Negative)
  int8_t panPriDir  = (lastPanSide > 0)  ? -1 : ((lastPanSide < 0)  ? 1 : -1);
  int8_t tiltPriDir = (lastTiltSide > 0) ? -1 : ((lastTiltSide < 0) ? 1 : -1);

