TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
  int32_t panClearRefPos  = 0;
  int32_t tiltClearRefPos = 0;
  bool panClearSawHigh    = false;
  bool tiltClearSawHigh   = false;

  Serial.printf("[Homing Plan] Pan PriDir: %s (NVS=%d) | Tilt PriDir: %s (NVS=%d)\n",
                (panPriDir > 0) ? "FORWARD (CW)" : "BACKWARD (CCW)", lastPanSide,
                (tiltPriDir > 0) ? "FORWARD (UP)" : "BACKWARD (DOWN)", lastTiltSide);

  sendMountTelemetry("Homing: Searching");

  // Helper lambda to assign and begin new movement for an axis state
  auto applyAxisState = [&](char axis, AxisHomingState state) {
    FastAccelStepper* stp = (axis == 'P') ? panStepper : tiltStepper;
    int32_t maxSteps = (axis == 'P') ? MAX_PAN_STEPS : MAX_TILT_STEPS;
    int8_t priDir = (axis == 'P') ? panPriDir : tiltPriDir;

    if (state == AXIS_PRE_CLEAR) {
      stp->setSpeedInHz(450);
      stp->applySpeedAcceleration();
      stp->moveTo(stp->getCurrentPosition() - (maxSteps / 4));
      if (axis == 'P') { panClearSawHigh = false; panClearRefPos = stp->getCurrentPosition(); }
      else             { tiltClearSawHigh = false; tiltClearRefPos = stp->getCurrentPosition(); }
    } else if (state == AXIS_SEARCH_PRI) {
      stp->setSpeedInHz(HOMING_SEARCH_SPEED_HZ);
      stp->applySpeedAcceleration();
      int32_t target = priDir * maxSteps;
      stp->moveTo(target);
      Serial.printf("[%s Search Pri] Moving to %ld (Limit: %ld stp)\n",
                    (axis == 'P') ? "Pan" : "Tilt", target, maxSteps);
    } else if (state == AXIS_SEARCH_REV) {
      stp->setSpeedInHz(HOMING_SEARCH_SPEED_HZ);
      stp->applySpeedAcceleration();
      int32_t target = -priDir * maxSteps;
      stp->moveTo(target);
      Serial.printf("[%s Search Rev] Full reverse sweep to opposite limit %ld\n",
                    (axis == 'P') ? "Pan" : "Tilt", target);
    } else if (state == AXIS_BACKOFF_NEG) {
      stp->setSpeedInHz(500);
      stp->applySpeedAcceleration();
      stp->moveTo(stp->getCurrentPosition() - (maxSteps / 4));
      if (axis == 'P') { panClearSawHigh = false; panClearRefPos = stp->getCurrentPosition(); }
      else             { tiltClearSawHigh = false; tiltClearRefPos = stp->getCurrentPosition(); }
    } else if (state == AXIS_CREEP_LATCH) {
      stp->setSpeedInHz(HOMING_CREEP_SPEED_HZ);
      stp->applySpeedAcceleration();
      stp->moveTo(stp->getCurrentPosition() + (maxSteps / 2));
    }
  };

  // Launch initial motions for both axes
  applyAxisState('P', panState);
  applyAxisState('T', tiltState);

  uint32_t homingLoopStartMs = millis();
  const uint32_t HOMING_MAX_TIMEOUT_MS = 50000; // Generous 50-second watchdog for complete bidirectional sweep

  while ((panState != AXIS_LATCHED && panState != AXIS_FAILED) ||
         (tiltState != AXIS_LATCHED && tiltState != AXIS_FAILED)) {

    if (checkHomingAbort()) {
      panStepper->forceStop();
      tiltStepper->forceStop();
      return false;
    }

    if (millis() - homingLoopStartMs > HOMING_MAX_TIMEOUT_MS) {
      Serial.println("\n[HOMING ERROR] Overall homing watchdog timeout exceeded! Stopping all motors.");
      panStepper->forceStop();
      tiltStepper->forceStop();
      return false;
    }

    // -----------------------------------------------------------------------
    // PAN AXIS STATE MACHINE
    // -----------------------------------------------------------------------
    if (panState == AXIS_PRE_CLEAR) {
      if (!panClearSawHigh && isHallClear(PIN_PAN_HALL)) {
        panClearSawHigh = true;
        panClearRefPos = panStepper->getCurrentPosition();
      }
      if (panClearSawHigh && (abs(panStepper->getCurrentPosition() - panClearRefPos) >= HOMING_BACKOFF_STEPS || !panStepper->isRunning())) {
        panStepper->forceStop();
        Serial.printf("[Pan Pre-Clear Done] Pos: %ld. Transitioning to Precision Creep Latch.\n", panStepper->getCurrentPosition());
        panState = AXIS_CREEP_LATCH;
        applyAxisState('P', panState);
      } else if (!panStepper->isRunning() && !panClearSawHigh) {
        panState = AXIS_SEARCH_PRI;
        applyAxisState('P', panState);
      }
    } else if (panState == AXIS_SEARCH_PRI) {
      if (isHallTripped(PIN_PAN_HALL)) {
        panStepper->forceStop();
        Serial.printf("[Pan Magnet Detected in PriSearch] Pos: %ld. Backing off negative.\n", panStepper->getCurrentPosition());
        panState = AXIS_BACKOFF_NEG;
        applyAxisState('P', panState);
      } else if (!panStepper->isRunning()) {
        Serial.printf("[Pan PriSearch Limit Reached (%ld stp)] Reversing search direction.\n", panStepper->getCurrentPosition());
        panState = AXIS_SEARCH_REV;
        applyAxisState('P', panState);
      }
    } else if (panState == AXIS_SEARCH_REV) {
      if (isHallTripped(PIN_PAN_HALL)) {
        panStepper->forceStop();
        Serial.printf("[Pan Magnet Detected in RevSearch] Pos: %ld. Backing off negative.\n", panStepper->getCurrentPosition());
        panState = AXIS_BACKOFF_NEG;
        applyAxisState('P', panState);
      } else if (!panStepper->isRunning()) {
        Serial.printf("[Pan ERROR] Full bidirectional sweep completed with no magnet detected! Pos: %ld\n", panStepper->getCurrentPosition());
        panState = AXIS_FAILED;
      }
    } else if (panState == AXIS_BACKOFF_NEG) {
      if (!panClearSawHigh && isHallClear(PIN_PAN_HALL)) {
        panClearSawHigh = true;
        panClearRefPos = panStepper->getCurrentPosition();
      }
      if (panClearSawHigh && (abs(panStepper->getCurrentPosition() - panClearRefPos) >= HOMING_BACKOFF_STEPS || !panStepper->isRunning())) {
        panStepper->forceStop();
        Serial.printf("[Pan Backoff Done] Pos: %ld. Starting Precision Creep Latch.\n", panStepper->getCurrentPosition());
        panState = AXIS_CREEP_LATCH;
        applyAxisState('P', panState);
      } else if (!panStepper->isRunning() && !panClearSawHigh) {
        panState = AXIS_CREEP_LATCH;
        applyAxisState('P', panState);
      }
    } else if (panState == AXIS_CREEP_LATCH) {
      if (isHallTripped(PIN_PAN_HALL)) {
        panStepper->forceStop();
        Serial.printf("[Pan LATCHED SUCCESS] Center Zero Edge Latched at Pos: %ld\n", panStepper->getCurrentPosition());
        panState = AXIS_LATCHED;
      } else if (!panStepper->isRunning()) {
        Serial.println("[Pan ERROR] Precision creep finished without detecting magnet edge!");
        panState = AXIS_FAILED;
      }
    }

    // -----------------------------------------------------------------------
    // TILT AXIS STATE MACHINE
    // -----------------------------------------------------------------------
    if (tiltState == AXIS_PRE_CLEAR) {
      if (!tiltClearSawHigh && isHallClear(PIN_TILT_HALL)) {
        tiltClearSawHigh = true;
        tiltClearRefPos = tiltStepper->getCurrentPosition();
      }
      if (tiltClearSawHigh && (abs(tiltStepper->getCurrentPosition() - tiltClearRefPos) >= HOMING_BACKOFF_STEPS || !tiltStepper->isRunning())) {
        tiltStepper->forceStop();
        Serial.printf("[Tilt Pre-Clear Done] Pos: %ld. Transitioning to Precision Creep Latch.\n", tiltStepper->getCurrentPosition());
        tiltState = AXIS_CREEP_LATCH;
        applyAxisState('T', tiltState);
      } else if (!tiltStepper->isRunning() && !tiltClearSawHigh) {
        tiltState = AXIS_SEARCH_PRI;
        applyAxisState('T', tiltState);
      }
    } else if (tiltState == AXIS_SEARCH_PRI) {
      if (isHallTripped(PIN_TILT_HALL)) {
        tiltStepper->forceStop();
        Serial.printf("[Tilt Magnet Detected in PriSearch] Pos: %ld. Backing off negative.\n", tiltStepper->getCurrentPosition());
        tiltState = AXIS_BACKOFF_NEG;
        applyAxisState('T', tiltState);
      } else if (!tiltStepper->isRunning()) {
        Serial.printf("[Tilt PriSearch Limit Reached (%ld stp)] Reversing search direction.\n", tiltStepper->getCurrentPosition());
        tiltState = AXIS_SEARCH_REV;
        applyAxisState('T', tiltState);
      }
    } else if (tiltState == AXIS_SEARCH_REV) {
      if (isHallTripped(PIN_TILT_HALL)) {
        tiltStepper->forceStop();
        Serial.printf("[Tilt Magnet Detected in RevSearch] Pos: %ld. Backing off negative.\n", tiltStepper->getCurrentPosition());
        tiltState = AXIS_BACKOFF_NEG;
        applyAxisState('T', tiltState);
      } else if (!tiltStepper->isRunning()) {
        Serial.printf("[Tilt ERROR] Full bidirectional sweep completed with no magnet detected! Pos: %ld\n", tiltStepper->getCurrentPosition());
        tiltState = AXIS_FAILED;
      }
    } else if (tiltState == AXIS_BACKOFF_NEG) {
      if (!tiltClearSawHigh && isHallClear(PIN_TILT_HALL)) {
        tiltClearSawHigh = true;
        tiltClearRefPos = tiltStepper->getCurrentPosition();
      }
      if (tiltClearSawHigh && (abs(tiltStepper->getCurrentPosition() - tiltClearRefPos) >= HOMING_BACKOFF_STEPS || !tiltStepper->isRunning())) {
        tiltStepper->forceStop();
        Serial.printf("[Tilt Backoff Done] Pos: %ld. Starting Precision Creep Latch.\n", tiltStepper->getCurrentPosition());
        tiltState = AXIS_CREEP_LATCH;
        applyAxisState('T', tiltState);
      } else if (!tiltStepper->isRunning() && !tiltClearSawHigh) {
        tiltState = AXIS_CREEP_LATCH;
        applyAxisState('T', tiltState);
      }
    } else if (tiltState == AXIS_CREEP_LATCH) {
      if (isHallTripped(PIN_TILT_HALL)) {
        tiltStepper->forceStop();
        Serial.printf("[Tilt LATCHED SUCCESS] Center Zero Edge Latched at Pos: %ld\n", tiltStepper->getCurrentPosition());
        tiltState = AXIS_LATCHED;
      } else if (!tiltStepper->isRunning()) {
        Serial.println("[Tilt ERROR] Precision creep finished without detecting magnet edge!");
        tiltState = AXIS_FAILED;
      }
    }

