TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
    delayMicroseconds(300);
  }

  // Check if any axis failed
  if (panState == AXIS_FAILED || tiltState == AXIS_FAILED) {
    Serial.printf("\n[HOMING FAILED] Calibration incomplete! PanState=%d, TiltState=%d\n", panState, tiltState);
    panStepper->forceStop();
    tiltStepper->forceStop();
    sendMountTelemetry("Homing: FAILED");
    return false;
  }

  // -------------------------------------------------------------------------
  // Stage 4: Apply Horizon Leveling Offset to Tilt
  // -------------------------------------------------------------------------
  if (tiltLevelOffset != 0) {
    Serial.printf("\n[Stage 4: Level Offset] Applying Tilt offset: %+ld steps...\n", tiltLevelOffset);
    sendMountTelemetry("Homing: Leveling");
    tiltStepper->setCurrentPosition(0);
    tiltStepper->setSpeedInHz(400);
    tiltStepper->applySpeedAcceleration();
    tiltStepper->moveTo(tiltLevelOffset);
    while (tiltStepper->isRunning()) {
      if (checkHomingAbort()) {
        tiltStepper->forceStop();
        return false;
      }
      delay(1);
    }
    delay(30);
    Serial.printf("[Stage 4 Done] Tilt Level Offset Position: %ld steps\n", tiltStepper->getCurrentPosition());
  }

  // -------------------------------------------------------------------------
  // Stage 5: Zero Coordinates & Complete Calibration
  // -------------------------------------------------------------------------
  panStepper->setCurrentPosition(0);
  tiltStepper->setCurrentPosition(0);

  panStepper->setSpeedInHz(MAX_SPEED_HZ);
  tiltStepper->setSpeedInHz(MAX_SPEED_HZ);
  panStepper->setAcceleration(ACCEL_HZ_S);
  tiltStepper->setAcceleration(ACCEL_HZ_S);
  panStepper->applySpeedAcceleration();
  tiltStepper->applySpeedAcceleration();

  savePanSideNVS(0);
  saveTiltSideNVS(0);

  Serial.println("\n=======================================================");
  Serial.println("[HOMING SUCCESS] Simultaneous 3-Axis Calibration Complete!");
  Serial.println("  Pan Axis  : 0.0 deg (Zero Reference Latched)");
  Serial.printf("  Tilt Axis : 0.0 deg (+%ld stp Level Offset Applied)\n", tiltLevelOffset);
  Serial.println("  Zoom Axis : 0.0% Wide (Physical Lens Stop Latched)");
  Serial.println("=======================================================\n");

  sendMountTelemetry("Homing Complete");
  return true;
}

void zoomHomingTask(void* pvParameters) {
  Serial.printf("[Zoom Homing Task] Started: Driving Wide to physical lens stop (%u ms)...\n", ZOOM_HOMING_TIME_MS);
  g_irActiveCmd = SONY_IR_CMD_ZOOM_WIDE;
  g_irActiveUntilMs = millis() + ZOOM_HOMING_TIME_MS;

  uint32_t startMs = millis();
  while (millis() - startMs < ZOOM_HOMING_TIME_MS) {
    if (checkHomingAbort()) {
      g_irActiveCmd = 0;
      g_irActiveUntilMs = 0;
      vTaskDelete(NULL);
      return;
    }
    vTaskDelay(pdMS_TO_TICKS(100));
  }

  g_irActiveCmd = 0;
  g_irActiveUntilMs = 0;
  currentZoomMs = 0;
  isZoomHomed = true;
  Serial.println("[Zoom Homing Task] Completed! Calibrated at 0.0% Wide (0 ms).");
  vTaskDelete(NULL);
}

void homeAll() {
  Serial.println("\n=================================================");
  Serial.println(">>> INITIATING SIMULTANEOUS 3-AXIS HOMING ROUTINE <<<");
  Serial.println("=================================================");

  isHomingInProgress = true;
  isZoomHomed = false;
  sendMountTelemetry("Homing In Progress...");

  // 1. Launch Zoom Wide homing concurrently in background task on Core 0
  xTaskCreatePinnedToCore(
    zoomHomingTask,
    "ZoomHomeTask",
    4096,
    NULL,
    1,
    NULL,
    0
  );

  // 2. Concurrently Home Both Stepper Axes in Parallel on Core 1
  bool steppersOk = homeAxesSimultaneous(TILT_LEVEL_OFFSET_STEPS);
  isPanHomed  = steppersOk;
  isTiltHomed = steppersOk;

  panState.dir = 0;
  panState.spd = 0;
  tiltState.dir = 0;
  tiltState.spd = 0;

  // 3. Wait for concurrent Zoom homing to conclude
  uint32_t waitStart = millis();
  while (!isZoomHomed && (millis() - waitStart < (ZOOM_HOMING_TIME_MS + 2000))) {
    delay(50);
  }

  isHomingInProgress = false;

  if (isPanHomed && isTiltHomed && isZoomHomed) {
    Serial.println(">>> SIMULTANEOUS HOMING COMPLETE: Pan, Tilt & Zoom Calibrated at Zero! <<<\n");
    savePanSideNVS(0);
    saveTiltSideNVS(0);
    sendMountTelemetry("Homing Complete (Centered)");
  } else {
    Serial.println(">>> [WARNING] Homing encountered issues or was aborted by user. <<<\n");
    sendMountTelemetry("Homing Aborted / Incomplete");
  }
}

// ---------------------------------------------------------------------------
// Velocity Command Mapping with Soft Travel Limits (+/-180 deg)
// ---------------------------------------------------------------------------
void applyVelocity(FastAccelStepper* st, int16_t cmd, MotorState& ms, int32_t maxLimitSteps, bool isPan) {
  if (!st) return;

  int32_t currentPos = st->getCurrentPosition();

  // Update center-direction side for Pan and Tilt axes in NVS
  if (isPan) {
    if (currentPos > 200)       savePanSideNVS(1);
    else if (currentPos < -200) savePanSideNVS(-1);
    else                        savePanSideNVS(0);
  } else {
    if (currentPos > 100)       saveTiltSideNVS(1);
    else if (currentPos < -100) saveTiltSideNVS(-1);
    else                        saveTiltSideNVS(0);
  }

  // Deadzone check
  if (abs(cmd) < JOY_DEAD) {
    if (ms.dir != 0) {
      st->stopMove();
      ms.dir = 0;
    }
    return;
  }

  int8_t dir = (cmd > 0) ? 1 : -1;

  // Dynamic Zoom-Dependent Speed & Acceleration Scaling:
  // When at full Wide (0% zoom), scale = 1.0 (full speed: MAX_SPEED_HZ, full accel: ACCEL_HZ_S).
  // As zoom increases toward Tele (100% zoom), pan & tilt speeds scale down smoothly
  // so telephoto framing is smooth, stable, and precise rather than twitchy.
  float zoomFraction = (float)currentZoomMs / (float)ZOOM_FULL_RANGE_MS;
  if (zoomFraction < 0.0f) zoomFraction = 0.0f;
  if (zoomFraction > 1.0f) zoomFraction = 1.0f;

  float speedScale = 1.0f - zoomFraction * (1.0f - ZOOM_SPEED_SCALE_MIN);
  float accelScale = 1.0f - zoomFraction * (1.0f - ZOOM_ACCEL_SCALE_MIN);

  uint32_t effectiveMaxSpeed = (uint32_t)(MAX_SPEED_HZ * speedScale);
  if (effectiveMaxSpeed < MIN_SPEED_HZ) effectiveMaxSpeed = MIN_SPEED_HZ;

