TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
  uint32_t effectiveAccel = (uint32_t)(ACCEL_HZ_S * accelScale);
  if (effectiveAccel < 3000) effectiveAccel = 3000;

  uint32_t spd = map(abs(cmd), JOY_DEAD, 1000, MIN_SPEED_HZ, effectiveMaxSpeed);

  // Soft Limit Check (+/-180 deg from center)
  if (dir > 0 && currentPos >= maxLimitSteps) {
    if (ms.dir != 0) {
      st->stopMove();
      ms.dir = 0;
    }
    return; // Block positive movement beyond limit
  }
  if (dir < 0 && currentPos <= -maxLimitSteps) {
    if (ms.dir != 0) {
      st->stopMove();
      ms.dir = 0;
    }
    return; // Block negative movement beyond limit
  }

  if (dir != ms.dir) {
    if (ms.dir != 0 && st->isRunning()) {
      st->forceStop();
    }
    st->setSpeedInHz(spd);
    st->setAcceleration(effectiveAccel);
    st->applySpeedAcceleration();
    if (dir > 0) st->runForward();
    else         st->runBackward();
    ms.dir = dir;
    ms.spd = spd;
  } else if (spd != ms.spd) {
    st->setSpeedInHz(spd);
    st->setAcceleration(effectiveAccel);
    st->applySpeedAcceleration();
    ms.spd = spd;
  }
}

void stopAllMotors() {
  if (panStepper) {
    panStepper->stopMove();
    panStepper->setSpeedInHz(MAX_SPEED_HZ);
    panStepper->setAcceleration(ACCEL_HZ_S);
    panStepper->applySpeedAcceleration();
  }
  if (tiltStepper) {
    tiltStepper->stopMove();
    tiltStepper->setSpeedInHz(MAX_SPEED_HZ);
    tiltStepper->setAcceleration(ACCEL_HZ_S);
    tiltStepper->applySpeedAcceleration();
  }
  panState.dir = 0;
  tiltState.dir = 0;
  isMovingToPreset = false;
  currentTargetPreset = 0;
  targetZoomMs = 0;   // P3: fully clear preset state so next command starts clean
  g_irActiveCmd = 0;  // Immediately halt any active IR zoom transmission
  g_irActiveUntilMs = 0;
}

// Queued asynchronous command flags (processed safely in loop() rather than Wi-Fi ISR)
volatile bool    reqHome       = false;
volatile uint8_t reqSavePreset = 0;
volatile uint8_t reqGotoPreset = 0;

// ---------------------------------------------------------------------------
// ESP-NOW Receive Callback (Fast & Non-Blocking)
// ---------------------------------------------------------------------------
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void onEspNowRecv(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
  const uint8_t* senderMac = info->src_addr;
#else
void onEspNowRecv(const uint8_t* senderMac, const uint8_t* data, int len) {
#endif
  if (len != (int)sizeof(PtzPacket)) return;
  const PtzPacket* pkt = (const PtzPacket*)data;

  // Track remote MAC
  if (!hasRemote || memcmp(remoteMac, senderMac, 6) != 0) {
    memcpy(remoteMac, senderMac, 6);
    hasRemote = true;
    if (!esp_now_is_peer_exist(remoteMac)) {
      esp_now_peer_info_t peer = {};
      memcpy(peer.peer_addr, remoteMac, 6);
      peer.channel = 0; // IMPORTANT: 0 uses active home channel
      peer.encrypt = false;
      peer.ifidx = WIFI_IF_STA;
      esp_now_add_peer(&peer);
    }
  }

  // Refresh link watchdog on ANY valid received packet from remote
  lastRxMs = millis();

  if (pkt->type == PKT_PAIR_REQ) {
    PtzPacket ack = {};
    ack.type = PKT_PAIR_ACK;
    WiFi.macAddress(ack.mac);
    esp_now_send(senderMac, (uint8_t*)&ack, sizeof(ack));
    sendMountTelemetry("Remote Handshake Established");
  } else if (pkt->type == PKT_CONTROL) {
    memcpy(&lastPkt, data, sizeof(lastPkt));
    rxFresh = true;
  } else if (pkt->type == PKT_SAVE_PRESET) {
    reqSavePreset = pkt->presetId;
  } else if (pkt->type == PKT_GOTO_PRESET) {
    reqGotoPreset = pkt->presetId;
  } else if (pkt->type == PKT_START_HOMING) {
    reqHome = true;
  }
}

// ---------------------------------------------------------------------------
// Arduino setup
// ---------------------------------------------------------------------------
void setup() {
  Serial.begin(115200);
  delay(1000);

  Serial.println("\n====================================================================");
  Serial.println("   ESP32-S3 N16R8 PTZ CAMERA MOUNT FIRMWARE (UART RECEIVER & IR)    ");
  Serial.println("====================================================================");
  Serial.println(" Pin Configuration:");
  Serial.printf("   Pan Driver  : EN=%d, STEP=%d, DIR=%d | Serial1 (TX=%d, RX=%d)\n",
                PIN_PAN_EN, PIN_PAN_STEP, PIN_PAN_DIR, PIN_PAN_TX, PIN_PAN_RX);
  Serial.printf("   Tilt Driver : EN=%d, STEP=%d, DIR=%d | Serial2 (TX=%d, RX=%d)\n",
                PIN_TILT_EN, PIN_TILT_STEP, PIN_TILT_DIR, PIN_TILT_TX, PIN_TILT_RX);
  Serial.printf("   IR Transmit : GPIO %d (40 kHz Sony 15-bit SIRC)\n", PIN_IR_IN);
  Serial.printf("   Sensors     : Pan Hall=GPIO %d, Tilt Hall=GPIO %d\n", PIN_PAN_HALL, PIN_TILT_HALL);
  Serial.printf("   Travel Limit: Pan +/-40 deg (%u steps), Tilt +/-45 deg (%u steps)\n",
                MAX_PAN_STEPS, MAX_TILT_STEPS);
  Serial.println("====================================================================");

  // Power sequencing: Park driver enables inactive (HIGH)
  pinMode(PIN_PAN_EN, OUTPUT);
  pinMode(PIN_TILT_EN, OUTPUT);
  digitalWrite(PIN_PAN_EN, HIGH);
  digitalWrite(PIN_TILT_EN, HIGH);

  Serial.printf("Waiting %u ms for 12V rail & TMC2209 logic to stabilize...\n", PWR_SETTLE_DELAY_MS);
  delay(PWR_SETTLE_DELAY_MS);
  Serial.println("12V rail settled - configuring hardware interfaces");

  // Configure Hall sensors with internal pull-ups
  pinMode(PIN_PAN_HALL, INPUT_PULLUP);
  pinMode(PIN_TILT_HALL, INPUT_PULLUP);

  // Configure auxiliary pins
  pinMode(PIN_RELAY_IN, OUTPUT);
  digitalWrite(PIN_RELAY_IN, LOW);

  // Initialize Sony 40 kHz IR LEDC hardware peripheral
  initIrLedc();
  Serial.printf("IR Transmitter initialized on GPIO %d (40 kHz carrier)\n", PIN_IR_IN);

  // Start the non-blocking IR transmit task (Core 0, priority 1; deterministic 45ms vTaskDelayUntil)
  xTaskCreatePinnedToCore(irTransmitTask, "IrTxTask", 4096, NULL, 1, NULL, 0);
  delay(10);

  // Load NVS stored presets and center memory
  loadPresetsFromNVS();
  loadPanSideNVS();
  loadTiltSideNVS();

  // Initialize FastAccelStepper pulse generator
  engine.init();
  panStepper  = setupStepper(PIN_PAN_STEP, PIN_PAN_DIR, PIN_PAN_EN);
  tiltStepper = setupStepper(PIN_TILT_STEP, PIN_TILT_DIR, PIN_TILT_EN);

