TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_PTZ_Mount_RX/ESP32S3_PTZ_Mount_RX.ino
  // Initialize HardwareSerial ports for dual-channel 1k-resistor UART
  Serial1.begin(115200, SERIAL_8N1, PIN_PAN_RX, PIN_PAN_TX);
  Serial2.begin(115200, SERIAL_8N1, PIN_TILT_RX, PIN_TILT_TX);
  delay(100);

  // Initialize TMC2209 drivers via UART (StealthChop2, 950mA RMS, 100% full holding torque)
  setupTMC2209(driverPan,  "Pan",  PIN_PAN_TX,  PIN_PAN_RX,  RMS_CURRENT_MA);
  setupTMC2209(driverTilt, "Tilt", PIN_TILT_TX, PIN_TILT_RX, RMS_CURRENT_MA);

  // Perform full startup homing (stepper center search & zoom calibration)
  homeAll();

  // Wi-Fi: Attempt to join the home AP (5 second timeout)
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  Serial.printf("Attempting Wi-Fi connection to '%s' (5s timeout)...", WIFI_SSID);
  uint32_t t0 = millis();
  wifiConnected = false;
  while (millis() - t0 < 5000) {
    if (WiFi.status() == WL_CONNECTED) {
      wifiConnected = true;
      break;
    }
    Serial.print('.');
    delay(250);
  }

  if (wifiConnected) {
    Serial.printf("\n[Wi-Fi] Connected to AP! IP: %s, Channel: %d\n",
                  WiFi.localIP().toString().c_str(), WiFi.channel());
  } else {
    Serial.println("\n[Wi-Fi] No router connection found. Operating in Standalone ESP-NOW mode on Channel 1.");
    WiFi.disconnect();
    esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
  }
  Serial.printf("Mount Receiver MAC Address: %s | Active Channel: %d\n",
                WiFi.macAddress().c_str(), WiFi.channel());

  // ESP-NOW initialization
  if (esp_now_init() != ESP_OK) {
    Serial.println("ESP-NOW init failed, rebooting ESP32-S3...");
    ESP.restart();
  }
  esp_now_register_recv_cb(onEspNowRecv);

  // Broadcast peer for handshake & discovery
  esp_now_peer_info_t bcast = {};
  memset(bcast.peer_addr, 0xFF, 6);
  bcast.channel = 0; // IMPORTANT: 0 uses active home channel!
  bcast.encrypt = false;
  bcast.ifidx = WIFI_IF_STA;
  esp_now_add_peer(&bcast);

  lastRxMs = millis();
  Serial.println("ESP-NOW initialized. Listening for remote transmitter...\n");
}

// ---------------------------------------------------------------------------
// Arduino loop (Real-time Motion, Zoom, Preset Execution, and Watchdogs)
// ---------------------------------------------------------------------------
void loop() {
  uint32_t now = millis();

  // 0. Process queued commands from ESP-NOW (safe main thread execution)
  if (reqHome) {
    reqHome = false;
    homeAll();
  }
  if (reqSavePreset > 0) {
    uint8_t p = reqSavePreset;
    reqSavePreset = 0;
    savePreset(p);
  }
  if (reqGotoPreset > 0) {
    uint8_t p = reqGotoPreset;
    reqGotoPreset = 0;
    gotoPreset(p);
  }

  // 1. Process incoming fresh ESP-NOW packet
  if (rxFresh) {
    rxFresh = false;
    if (!linkAlive) {
      linkAlive = true;
      Serial.println("[LINK] Control link established with Remote TX");
      sendMountTelemetry("Remote Control Link Active");
    }

    // Manual joystick overrides preset transition (requires deliberate stick movement > 600)
    if (isMovingToPreset && (abs(lastPkt.pan) > 600 || abs(lastPkt.tilt) > 600)) {
      stopAllMotors();
      Serial.println("[MANUAL OVERRIDE] Preset motion aborted by joystick input.");
      sendMountTelemetry("Preset Move Aborted by Joystick");
    }

    if (!isMovingToPreset) {
      applyVelocity(panStepper,  lastPkt.pan,  panState,  MAX_PAN_STEPS,  true);
      applyVelocity(tiltStepper, lastPkt.tilt, tiltState, MAX_TILT_STEPS, false);
      applyZoom(lastPkt.zoom);
    }
  }

  // 2. Coordinated Preset Execution (Steppers + Zoom)
  if (isMovingToPreset) {
    updatePresetZoomMove();

    bool panBusy = (panStepper && panStepper->isRunning());
    bool tiltBusy = (tiltStepper && tiltStepper->isRunning());
    bool zoomBusy = (abs((int32_t)targetZoomMs - (int32_t)currentZoomMs) >= ZOOM_TICK_MS);

    if (!panBusy && !tiltBusy && !zoomBusy) {
      uint8_t pReached = currentTargetPreset;
      stopAllMotors(); // Cleanly resets preset state and restores manual speeds/accels

      char evt[32];
      snprintf(evt, sizeof(evt), "Preset %u Reached", pReached);
      sendMountTelemetry(evt);
    }
  }

  // 2b. Fast zoom telemetry: while the zoom lens is actively moving, report every 100 ms
  // so the remote's percentage tracks smoothly(no stale 2.5s gaps that caused big jumps..
  static uint32_t lastFastZoomTelemMs = 0;
  bool zoomActive = (now - irLastCmdMs < ZOOM_ACTIVE_WINDOW_MS);

  if (zoomActive && (now - lastFastZoomTelemMs >= ZOOM_FAST_TELEMETRY_MS)) {



    lastFastZoomTelemMs = now;

    sendMountTelemetry();
  }

  // 3. Failsafe: Link loss timeout watchdog -> halt motion & clear all preset state
  if (linkAlive && now - lastRxMs > RX_TIMEOUT_MS) {
    linkAlive = false;
    stopAllMotors();
    Serial.println("[LINK WARNING] Link timeout - motors and zoom safely stopped");
  }

  // 4. (Hall sensor state is broadcast silently in every periodic telemetry heartbeat — no separate edge events)

  // 5. Periodic UART & System Telemetry Heartbeat (every 2.5 seconds to remote)
  static uint32_t lastTelemetryMs = 0;
  if (now - lastTelemetryMs >= 2500) {
    lastTelemetryMs = now;

    // Verify driver IC versions over UART periodically
    panDriverVersion = driverPan.version();
    panUartOk = (panDriverVersion == 0x21);
    tiltDriverVersion = driverTilt.version();
    tiltUartOk = (tiltDriverVersion == 0x21);

    // Send telemetry to remote
    sendMountTelemetry();

    bool panHallNow  = (digitalRead(PIN_PAN_HALL)  == LOW);
    bool tiltHallNow = (digitalRead(PIN_TILT_HALL) == LOW);

    int32_t pPos = panStepper  ? panStepper->getCurrentPosition()  : 0;
    int32_t tPos = tiltStepper ? tiltStepper->getCurrentPosition() : 0;
    float zoomPct = (float)currentZoomMs / ZOOM_FULL_RANGE_MS * 100.0f;

    Serial.printf("[TELEMETRY %lus] Link: %s | Pan: %ld stp (%s, Hall: %s) | Tilt: %ld stp (Hall: %s) | Zoom: %ld ms (%0.1f%%) | UART: P=%s T=%s\n",
                  now / 1000,
                  linkAlive ? "ALIVE" : "WAITING",
                  pPos, (lastPanSide > 0) ? "RIGHT" : ((lastPanSide < 0) ? "LEFT" : "CENTER"),
                  panHallNow ? "TRIP" : "OK",
                  tPos, tiltHallNow ? "TRIP" : "OK",
                  currentZoomMs, zoomPct,
                  panUartOk ? "OK" : "ERR", tiltUartOk ? "OK" : "ERR");
  }

  // 6. Wi-Fi watchdog: Auto-reconnect ONLY if router Wi-Fi was established on boot
  static uint32_t lastWifiCheck = 0;
  if (wifiConnected && (now - lastWifiCheck > 10000)) {
    lastWifiCheck = now;
    if (WiFi.status() != WL_CONNECTED) {
      Serial.println("[WiFi WARNING] Wi-Fi lost, reconnecting...");
      WiFi.reconnect();
    }
  }
}


